'''You can fill your measured data here, so in the file `data_analysis.py`
    you can directly import the data from this file.'''
  
  
'''方法一数据'''  
# 质量测量值
m_1 = 3.83 # g
m_2 = 1.02 # g
m_3 = 0.87 # g

# 直径测量值

x_0 = -0.023 # mm, 螺旋测微仪零点误差
x_1 = [10.611,10.595,10.608,10.610,10.598,10.596] # mm, 物体1直径测量值
x_2 = [8.409,8.412,8.402,8.414,8.415,8.415]       # mm, 物体2直径测量值
x_3 = [8.428,8.425,8.426,8.425,8.428,8.427]       # mm, 物体3直径测量值

'''方法二数据'''  
m_before_1 = [473.52, 473.50, 473.48, 473.45, 473.40, 473.30] # g, 物体1加水前质量
m_after_1 = [474.13, 474.11, 474.10, 474.07, 474.02, 473.95]  # g, 物体1加水后质量
m_before_2 = [473.72, 473.65, 473.59, 474.09, 473.97, 473.84] # g, 物体2加水前质量
m_after_2 = [473.97, 473.89, 473.85, 474.34, 474.23, 474.08]  # g, 物体2加水后质量
m_before_3 = [474.60, 474.49, 474.37, 474.28, 474.19, 474.08] # g, 物体3加水前质量
m_after_3 = [474.86, 474.74, 474.63, 474.55, 474.45, 474.33]  # g, 物体3加水后质量