'''You can fill your measured data here, so in the file `data_analysis.py`
    you can directly import the data from this file.'''
  
  
L_1 = 48.10 #cm
L_2 = 2.000 #cm
L = L_1 + 0.5*L_2  #cm

#改变摆角
theta_T = [
    {
        "theta_value": 3, 
        "2T_values": [2.770, 2.770, 2.771, 2.771, 2.773]
    },
    {
        "theta_value": 6, 
        "2T_values": [2.787, 2.782, 2.782, 2.782, 2.782]
    },
    {
        "theta_value": 9, 
        "2T_values": [2.786, 2.787, 2.786, 2.787, 2.786] 
    },
    {
        "theta_value": 12, 
        "2T_values": [2.792, 2.792, 2.792, 2.792, 2.791]
    },
    {
        "theta_value": 15, 
        "2T_values": [2.796, 2.796, 2.794, 2.796, 2.796]
    },
    {
        "theta_value": 18, 
        "2T_values": [2.801, 2.801, 2.801, 2.801, 2.800]
    }
]

L_T = [
    {
        "L1": 54.00,
        "L": 55.00,
        "2T_values": [2.940, 2.942, 2.941, 2.940, 2.940]
    },
    {
        "L1": 49.00,
        "L": 50.00,
        "2T_values": [2.806, 2.803, 2.804, 2.806, 2.806]
    },
    {
        "L1": 44.00,
        "L": 45.00,
        "2T_values": [2.652, 2.651, 2.651, 2.651, 2.651]
    },
    {
        "L1": 39.00,
        "L": 40.00,
        "2T_values": [2.533, 2.508, 2.505, 2.506, 2.506]
    },
    {
        "L1": 34.00,
        "L": 35.00,
        "2T_values": [2.330, 2.329, 2.330, 2.329, 2.329]
    }
]